In [1]:
import pandas as pd

In [2]:
series={
    'index':[0,1,2,3],
    'Data':[142,145,123,101],
    'name':'gsr'
    }

In [3]:
def get(series,idx):
    value_idx=series['index'].index(idx)
    return series['Data'][value_idx]
get(series,1)

145

In [4]:
#we can do this in different way also 
data=[142,145,123,101]
my_series=pd.Series(data)

In [5]:
#Access the second elements
print(my_series[1])

145

In [6]:
gsr=my_series+10
gsr

0    152
1    155
2    133
3    111
dtype: int64

In [7]:
#Access the range of elements
print(my_series[1:4])

1    145
2    123
3    101
dtype: int64

In [8]:
songs={
    'index':['paul','john','george','ringo'],
    'data':[145,142,143,146],
    'name':'count'
    
}

In [9]:
def get(series,idx):
    value_idx=series['index'].index(idx)
    return series['data'][value_idx]
get(songs,'paul')

145

In [10]:
songs2=pd.Series([1,2,3,4],
       name='counts',
    index=['john','paul','george','ringo']
                )

In [11]:
songs2

john      1
paul      2
george    3
ringo     4
Name: counts, dtype: int64

Note that the dtype that we see when we print a Series is the type of the values, not the
index

In [12]:
songs2 . index

Index(['john', 'paul', 'george', 'ringo'], dtype='object')

when we inspect index attribute we see that the dtype is object

In [13]:
name={
    'first':['george','paul','anna','avi'],
    'last':['lamma','christ','lame','naka'],
    'email':['lamma@gmail.com','christ@gmail.com','lame@gmail.com','naka@gmail.com']
}

In [14]:
name['email']

['lamma@gmail.com', 'christ@gmail.com', 'lame@gmail.com', 'naka@gmail.com']

In [15]:
type(name['email'])

list

In [16]:
import pandas as pd

In [17]:
df=pd.DataFrame(name)

In [18]:
df

    first    last             email
0  george   lamma   lamma@gmail.com
1    paul  christ  christ@gmail.com
2    anna    lame    lame@gmail.com
3     avi    naka    naka@gmail.com

"This DataFrame is two-dimensional, consisting of rows and columns, and the 'name' field is stored as a dictionary

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df['email']

0     lamma@gmail.com
1    christ@gmail.com
2      lame@gmail.com
3      naka@gmail.com
Name: email, dtype: object

When comparing the results from the email to the previous set, it's important to note that the email results form a series. Additionally, the numbers 0, 1, 2, and 3 are used to represent axes and should not be considered as separate columns."

In [21]:
df.email

0     lamma@gmail.com
1    christ@gmail.com
2      lame@gmail.com
3      naka@gmail.com
Name: email, dtype: object

to ensure compatibility and readability, it's often safer to use df['column_name'].
 if your column names are simple and do not contain spaces or special characters, you can use df.column_name
 
but it's is totally user choice he might use any one of them

In [22]:
type(df['email'])

pandas.core.series.Series

"A 'data frame' is a 2-dimensional container for multiple series objects"

In [23]:
df[['last','email']]

     last             email
0   lamma   lamma@gmail.com
1  christ  christ@gmail.com
2    lame    lame@gmail.com
3    naka    naka@gmail.com

The double brackets are required to distinguish between the selection of multiple columns, as opposed to a single column. By using the inner brackets to create a list of column names, you can select multiple columns simultaneously. If you were selecting a single column, you could omit the inner brackets and write, for example, df['last'] to select the 'last' column

In [24]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [25]:
df.iloc[[0,1]]

    first    last             email
0  george   lamma   lamma@gmail.com
1    paul  christ  christ@gmail.com

Use loc when you want to select data based on label names and when you need to include both the start and stop indices.

Use iloc when you want to select data based on integer positions and when you want to exclude the stop index (exclusive).

In [26]:
df.iloc[[0,1],2]

0     lamma@gmail.com
1    christ@gmail.com
Name: email, dtype: object

In [27]:
df.loc[0]

first             george
last               lamma
email    lamma@gmail.com
Name: 0, dtype: object

In [28]:
df.loc[[0,1]]

    first    last             email
0  george   lamma   lamma@gmail.com
1    paul  christ  christ@gmail.com

In [29]:
df.loc[[0,1],['email']]

              email
0   lamma@gmail.com
1  christ@gmail.com

In [30]:
df.loc[[0,1],['email','first']]

              email   first
0   lamma@gmail.com  george
1  christ@gmail.com    paul

In [31]:
df.set_index('email',inplace=True)  #setting email as index and if you not use inplace =true then there is no change

In [32]:
df

                   first    last
email
lamma@gmail.com   george   lamma
christ@gmail.com    paul  christ
lame@gmail.com      anna    lame
naka@gmail.com       avi    naka

In [33]:
df.index

Index(['lamma@gmail.com', 'christ@gmail.com', 'lame@gmail.com',
       'naka@gmail.com'],
      dtype='object', name='email')

In [34]:
df.loc['lamma@gmail.com']

first    george
last      lamma
Name: lamma@gmail.com, dtype: object

In [35]:
df.loc['lamma@gmail.com','last']

'lamma'

In [36]:
# df.loc[0] =>this gives error 
     #but
df.iloc[0]

first    george
last      lamma
Name: lamma@gmail.com, dtype: object

In [37]:
df.reset_index(inplace=True)

In [38]:
df

              email   first    last
0   lamma@gmail.com  george   lamma
1  christ@gmail.com    paul  christ
2    lame@gmail.com    anna    lame
3    naka@gmail.com     avi    naka

**Now Onwards Filtering

In [41]:
name={
    'first':['james','john','jonny'],
    'last':['christ','dow','dow'],
    'email':['jameschrist@email.com','johndow@gmail.com','jonnydow@gmail.com']
}

In [42]:
var=pd.DataFrame(name)

In [43]:
var

   first    last                  email
0  james  christ  jameschrist@email.com
1   john     dow      johndow@gmail.com
2  jonny     dow     jonnydow@gmail.com

In [46]:
filt=(var['last']=="dow")

In [47]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [49]:
var[filt]

   first last               email
1   john  dow   johndow@gmail.com
2  jonny  dow  jonnydow@gmail.com

In [50]:
var.loc[filt]

   first last               email
1   john  dow   johndow@gmail.com
2  jonny  dow  jonnydow@gmail.com

in above you get same answer by passing the paramters in different way 
in pandas there is multiple way to get same answer

In [51]:
 var.loc[filt,'email']

1     johndow@gmail.com
2    jonnydow@gmail.com
Name: email, dtype: object

In [57]:
filt=(var['last']=="dow") & (var['first']=='john')
var.loc[filt]

  first last              email
1  john  dow  johndow@gmail.com

In [59]:
filt=(var['last']=="dow") | (var['first']=='james')
var.loc[filt]

   first    last                  email
0  james  christ  jameschrist@email.com
1   john     dow      johndow@gmail.com
2  jonny     dow     jonnydow@gmail.com